AlmAck/svdtonuttx/demo/h/da1470x_memctrl.h
/****************************************************************************
 * ./tmp/da1470x_memctrl.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __DA1470X_MEMCTRL_H
#define __DA1470X_MEMCTRL_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "da1470x_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define DA1470X_MEMCTRL_BUSY_RESET_OFFSET       0x0078 /* BSR Reset Register */
#define DA1470X_MEMCTRL_BUSY_RESET2_OFFSET      0x007C /* BSR2 Reset Register */
#define DA1470X_MEMCTRL_BUSY_SET_OFFSET         0x0070 /* BSR Set Register */
#define DA1470X_MEMCTRL_BUSY_SET2_OFFSET        0x0074 /* BSR2 Set Register */
#define DA1470X_MEMCTRL_BUSY_STAT_OFFSET        0x0080 /* BSR Status Register */
#define DA1470X_MEMCTRL_BUSY_STAT2_OFFSET       0x0084 /* BSR2 Status Register */
#define DA1470X_MEMCTRL_CMAC_STATUS_OFFSET      0x0030 /* Memory Arbiter Status Register */
#define DA1470X_MEMCTRL_CMI_CODE_BASE_OFFSET    0x0020 /* CMAC code Base Address Register */
#define DA1470X_MEMCTRL_CMI_DATA_BASE_OFFSET    0x0024 /* CMAC data Base Address Register */
#define DA1470X_MEMCTRL_CMI_END_OFFSET          0x002C /* CMAC end Address Register */
#define DA1470X_MEMCTRL_CMI_SHARED_BASE_OFFSET  0x0028 /* CMAC shared data Base Address Register */
#define DA1470X_MEMCTRL_MEM_PRIO_ARB1_4_OFFSET  0x0004 /* Priority Control Register for arbiter 1, 2, 3 and 4 */
#define DA1470X_MEMCTRL_MEM_PRIO_ARB5_8_OFFSET  0x0008 /* Priority Control Register for arbiter 5, 6, 7 and 8 */
#define DA1470X_MEMCTRL_MEM_STALL_OFFSET        0x0010 /* Maximum Stall cycles Control Register */
#define DA1470X_MEMCTRL_MEM_STATUS2_OFFSET      0x0018 /* RAM cells Status Register */
#define DA1470X_MEMCTRL_MEM_STATUS_OFFSET       0x0014 /* Memory Arbiter Status Register */

/* Register addresses *******************************************************/

#define DA1470X_MEMCTRL_BASE                    0x50050000 /* MEMCTRL registers */

#define DA1470X_MEMCTRL_BUSY_RESET              (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_RESET_OFFSET) /* BSR Reset Register */
#define DA1470X_MEMCTRL_BUSY_RESET2             (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_RESET2_OFFSET) /* BSR2 Reset Register */
#define DA1470X_MEMCTRL_BUSY_SET                (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_SET_OFFSET) /* BSR Set Register */
#define DA1470X_MEMCTRL_BUSY_SET2               (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_SET2_OFFSET) /* BSR2 Set Register */
#define DA1470X_MEMCTRL_BUSY_STAT               (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_STAT_OFFSET) /* BSR Status Register */
#define DA1470X_MEMCTRL_BUSY_STAT2              (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_BUSY_STAT2_OFFSET) /* BSR2 Status Register */
#define DA1470X_MEMCTRL_CMAC_STATUS             (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_CMAC_STATUS_OFFSET) /* Memory Arbiter Status Register */
#define DA1470X_MEMCTRL_CMI_CODE_BASE           (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_CMI_CODE_BASE_OFFSET) /* CMAC code Base Address Register */
#define DA1470X_MEMCTRL_CMI_DATA_BASE           (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_CMI_DATA_BASE_OFFSET) /* CMAC data Base Address Register */
#define DA1470X_MEMCTRL_CMI_END                 (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_CMI_END_OFFSET) /* CMAC end Address Register */
#define DA1470X_MEMCTRL_CMI_SHARED_BASE         (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_CMI_SHARED_BASE_OFFSET) /* CMAC shared data Base Address Register */
#define DA1470X_MEMCTRL_MEM_PRIO_ARB1_4         (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_MEM_PRIO_ARB1_4_OFFSET) /* Priority Control Register for arbiter 1, 2, 3 and 4 */
#define DA1470X_MEMCTRL_MEM_PRIO_ARB5_8         (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_MEM_PRIO_ARB5_8_OFFSET) /* Priority Control Register for arbiter 5, 6, 7 and 8 */
#define DA1470X_MEMCTRL_MEM_STALL               (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_MEM_STALL_OFFSET) /* Maximum Stall cycles Control Register */
#define DA1470X_MEMCTRL_MEM_STATUS2             (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_MEM_STATUS2_OFFSET) /* RAM cells Status Register */
#define DA1470X_MEMCTRL_MEM_STATUS              (DA1470X_MEMCTRL_BASE + DA1470X_MEMCTRL_MEM_STATUS_OFFSET) /* Memory Arbiter Status Register */

/* Register bit definitions *************************************************/


/* BUSY_RESET Register */

#define MEMCTRL_BUSY_SDADC_MASK                 (0x3 << 30) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SDADC_POS                  (30) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_GPADC_MASK                 (0x3 << 28) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_GPADC_POS                  (28) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SRC2_MASK                  (0x3 << 26) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SRC2_POS                   (26) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SRC_MASK                   (0x3 << 24) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SRC_POS                    (24) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_PDM_MASK                   (0x3 << 22) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_PDM_POS                    (22) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_PCM_MASK                   (0x3 << 20) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_PCM_POS                    (20) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I3C_MASK                   (0x3 << 18) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I3C_POS                    (18) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C3_MASK                  (0x3 << 16) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C3_POS                   (16) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C2_MASK                  (0x3 << 14) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C2_POS                   (14) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C_MASK                   (0x3 << 12) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_I2C_POS                    (12) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI3_MASK                  (0x3 << 10) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI3_POS                   (10) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI2_MASK                  (0x3 << 8) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI2_POS                   (8) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI_MASK                   (0x3 << 6) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_SPI_POS                    (6) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART3_MASK                 (0x3 << 4) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART3_POS                  (4) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART2_MASK                 (0x3 << 2) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART2_POS                  (2) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART_MASK                  (0x3 << 0) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_UART_POS                   (0) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */

