AlmAck/svdtonuttx/demo/h/da1470x_memctrl.h
/* BUSY_RESET2 Register */

#define MEMCTRL_BUSY_TIMER6_MASK                (0x3 << 10) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER6_POS                 (10) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER5_MASK                (0x3 << 8) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER5_POS                 (8) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER4_MASK                (0x3 << 6) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER4_POS                 (6) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER3_MASK                (0x3 << 4) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER3_POS                 (4) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER2_MASK                (0x3 << 2) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER2_POS                 (2) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER_MASK                 (0x3 << 0) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */
#define MEMCTRL_BUSY_TIMER_POS                  (0) /* Clear the BUSY bitfield, by writing the master code which has claimed to this fi */

/* BUSY_SET Register */

#define MEMCTRL_BUSY_SDADC_MASK                 (0x3 << 30) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SDADC_POS                  (30) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_GPADC_MASK                 (0x3 << 28) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_GPADC_POS                  (28) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SRC2_MASK                  (0x3 << 26) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SRC2_POS                   (26) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SRC_MASK                   (0x3 << 24) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SRC_POS                    (24) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_PDM_MASK                   (0x3 << 22) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_PDM_POS                    (22) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_PCM_MASK                   (0x3 << 20) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_PCM_POS                    (20) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I3C_MASK                   (0x3 << 18) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I3C_POS                    (18) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C3_MASK                  (0x3 << 16) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C3_POS                   (16) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C2_MASK                  (0x3 << 14) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C2_POS                   (14) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C_MASK                   (0x3 << 12) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_I2C_POS                    (12) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI3_MASK                  (0x3 << 10) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI3_POS                   (10) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI2_MASK                  (0x3 << 8) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI2_POS                   (8) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI_MASK                   (0x3 << 6) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_SPI_POS                    (6) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART3_MASK                 (0x3 << 4) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART3_POS                  (4) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART2_MASK                 (0x3 << 2) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART2_POS                  (2) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART_MASK                  (0x3 << 0) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_UART_POS                   (0) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */

/* BUSY_SET2 Register */

#define MEMCTRL_BUSY_TIMER6_MASK                (0x3 << 10) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER6_POS                 (10) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER5_MASK                (0x3 << 8) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER5_POS                 (8) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER4_MASK                (0x3 << 6) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER4_POS                 (6) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER3_MASK                (0x3 << 4) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER3_POS                 (4) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER2_MASK                (0x3 << 2) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER2_POS                 (2) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER_MASK                 (0x3 << 0) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */
#define MEMCTRL_BUSY_TIMER_POS                  (0) /* Writing a non-zero value to this field sets the corresponding BUSY bit, but only */

