AlmAck/svdtonuttx/demo/h/da1470x_memctrl.h
/* CMI_CODE_BASE Register */

#define MEMCTRL_CMI_CODE_BASE_ADDR_MASK         (0xFFFFF << 0) /* Base address for CMAC code. Note: Uses the CMAC Physical address space provided  */
#define MEMCTRL_CMI_CODE_BASE_ADDR_POS          (0) /* Base address for CMAC code. Note: Uses the CMAC Physical address space provided  */

/* CMI_DATA_BASE Register */

#define MEMCTRL_CMI_DATA_BASE_ADDR_MASK         (0x3FFFF << 2) /* Base address for CMAC data with steps of 4 bytes. 0x00001: 4 byte base address 0 */
#define MEMCTRL_CMI_DATA_BASE_ADDR_POS          (2) /* Base address for CMAC data with steps of 4 bytes. 0x00001: 4 byte base address 0 */

/* CMI_END Register */

#define MEMCTRL_CMI_END_ADDR_MASK               (0x3FF << 10) /* End address for CMAC code and data accesses with steps of 1 kB. 0x000: accesses  */
#define MEMCTRL_CMI_END_ADDR_POS                (10) /* End address for CMAC code and data accesses with steps of 1 kB. 0x000: accesses  */

/* CMI_SHARED_BASE Register */

#define MEMCTRL_CMI_SHARED_BASE_ADDR_MASK       (0x3FF << 10) /* Base address for CMAC shared data with steps of 1 kB. 0x001: 1 kB base address 0 */
#define MEMCTRL_CMI_SHARED_BASE_ADDR_POS        (10) /* Base address for CMAC shared data with steps of 1 kB. 0x001: 1 kB base address 0 */

/* MEM_PRIO_ARB1_4 Register */

#define MEMCTRL_ARB4_AHB_DMA_PRIO_MASK          (0x3 << 28) /* Priority for the DMA AHB interface of arbiter 4 00: low priority (default) 01: m */
#define MEMCTRL_ARB4_AHB_DMA_PRIO_POS           (28) /* Priority for the DMA AHB interface of arbiter 4 00: low priority (default) 01: m */
#define MEMCTRL_ARB4_AHB_CPUS_PRIO_MASK         (0x3 << 26) /* Priority for the CPUS AHB interface of arbiter 4. 00: low priority (default) 01: */
#define MEMCTRL_ARB4_AHB_CPUS_PRIO_POS          (26) /* Priority for the CPUS AHB interface of arbiter 4. 00: low priority (default) 01: */
#define MEMCTRL_ARB3_AHB_DMA_PRIO_MASK          (0x3 << 20) /* Priority for the DMA AHB interface of arbiter 3 00: low priority (default) 01: m */
#define MEMCTRL_ARB3_AHB_DMA_PRIO_POS           (20) /* Priority for the DMA AHB interface of arbiter 3 00: low priority (default) 01: m */
#define MEMCTRL_ARB3_AHB_CPUS_PRIO_MASK         (0x3 << 18) /* Priority for the CPUS AHB interface of arbiter 3. 00: low priority (default) 01: */
#define MEMCTRL_ARB3_AHB_CPUS_PRIO_POS          (18) /* Priority for the CPUS AHB interface of arbiter 3. 00: low priority (default) 01: */
#define MEMCTRL_ARB3_AHB_CPUC_PRIO_MASK         (0x3 << 16) /* Priority for the CPUC AHB interface of arbiter 3. 00: low priority (default) 01: */
#define MEMCTRL_ARB3_AHB_CPUC_PRIO_POS          (16) /* Priority for the CPUC AHB interface of arbiter 3. 00: low priority (default) 01: */
#define MEMCTRL_ARB2_SNC_PRIO_MASK              (0x3 << 14) /* Priority for the SNC interface of arbiter 2. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB2_SNC_PRIO_POS               (14) /* Priority for the SNC interface of arbiter 2. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB2_AHB_DMA_PRIO_MASK          (0x3 << 12) /* Priority for the DMA AHB interface of arbiter 2. 00: low priority (default) 01:  */
#define MEMCTRL_ARB2_AHB_DMA_PRIO_POS           (12) /* Priority for the DMA AHB interface of arbiter 2. 00: low priority (default) 01:  */
#define MEMCTRL_ARB2_AHB_CPUS_PRIO_MASK         (0x3 << 10) /* Priority for the CPUS AHB interface of arbiter 2. 00: low priority (default) 01: */
#define MEMCTRL_ARB2_AHB_CPUS_PRIO_POS          (10) /* Priority for the CPUS AHB interface of arbiter 2. 00: low priority (default) 01: */
#define MEMCTRL_ARB2_AHB_CPUC_PRIO_MASK         (0x3 << 8) /* Priority for the CPUC AHB interface of arbiter 2. 00: low priority (default) 01: */
#define MEMCTRL_ARB2_AHB_CPUC_PRIO_POS          (8) /* Priority for the CPUC AHB interface of arbiter 2. 00: low priority (default) 01: */
#define MEMCTRL_ARB1_SNC_PRIO_MASK              (0x3 << 6) /* Priority for the SNC interface of arbiter 1. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB1_SNC_PRIO_POS               (6) /* Priority for the SNC interface of arbiter 1. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB1_AHB_DMA_PRIO_MASK          (0x3 << 4) /* Priority for the DMA AHB interface of arbiter 1. 00: low priority (default) 01:  */
#define MEMCTRL_ARB1_AHB_DMA_PRIO_POS           (4) /* Priority for the DMA AHB interface of arbiter 1. 00: low priority (default) 01:  */
#define MEMCTRL_ARB1_AHB_CPUS_PRIO_MASK         (0x3 << 2) /* Priority for the CPUS AHB interface of arbiter 1. 00: low priority (default) 01: */
#define MEMCTRL_ARB1_AHB_CPUS_PRIO_POS          (2) /* Priority for the CPUS AHB interface of arbiter 1. 00: low priority (default) 01: */
#define MEMCTRL_ARB1_AHB_CPUC_PRIO_MASK         (0x3 << 0) /* Priority for the CPUC AHB interface of arbiter 1. 00: low priority (default) 01: */
#define MEMCTRL_ARB1_AHB_CPUC_PRIO_POS          (0) /* Priority for the CPUC AHB interface of arbiter 1. 00: low priority (default) 01: */

/* MEM_PRIO_ARB5_8 Register */

#define MEMCTRL_ARB8_SNC_PRIO_MASK              (0x3 << 30) /* Priority for the SNC interface of arbiter 8. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB8_SNC_PRIO_POS               (30) /* Priority for the SNC interface of arbiter 8. 00: low priority (default) 01: mid  */
#define MEMCTRL_ARB8_AHB_DMA_PRIO_MASK          (0x3 << 28) /* Priority for the DMA AHB interface of arbiter 8. 00: low priority (default) 01:  */
#define MEMCTRL_ARB8_AHB_DMA_PRIO_POS           (28) /* Priority for the DMA AHB interface of arbiter 8. 00: low priority (default) 01:  */
#define MEMCTRL_ARB8_AHB_CPUS_PRIO_MASK         (0x3 << 26) /* Priority for the CPUS AHB interface of arbiter 8. 00: low priority (default) 01: */
#define MEMCTRL_ARB8_AHB_CPUS_PRIO_POS          (26) /* Priority for the CPUS AHB interface of arbiter 8. 00: low priority (default) 01: */
#define MEMCTRL_ARB7_AHB_DMA_PRIO_MASK          (0x3 << 20) /* Priority for the DMA AHB interface of arbiter 7. 00: low priority (default) 01:  */
#define MEMCTRL_ARB7_AHB_DMA_PRIO_POS           (20) /* Priority for the DMA AHB interface of arbiter 7. 00: low priority (default) 01:  */
#define MEMCTRL_ARB7_AHB_CPUS_PRIO_MASK         (0x3 << 18) /* Priority for the CPUS AHB interface of arbiter 7. 00: low priority (default) 01: */
#define MEMCTRL_ARB7_AHB_CPUS_PRIO_POS          (18) /* Priority for the CPUS AHB interface of arbiter 7. 00: low priority (default) 01: */
#define MEMCTRL_ARB6_AHB_DMA_PRIO_MASK          (0x3 << 12) /* Priority for the DMA AHB interface of arbiter 6. 00: low priority (default) 01:  */
#define MEMCTRL_ARB6_AHB_DMA_PRIO_POS           (12) /* Priority for the DMA AHB interface of arbiter 6. 00: low priority (default) 01:  */
#define MEMCTRL_ARB6_AHB_CPUS_PRIO_MASK         (0x3 << 10) /* Priority for the CPUS AHB interface of arbiter 6. 00: low priority (default) 01: */
#define MEMCTRL_ARB6_AHB_CPUS_PRIO_POS          (10) /* Priority for the CPUS AHB interface of arbiter 6. 00: low priority (default) 01: */
#define MEMCTRL_ARB5_AHB_DMA_PRIO_MASK          (0x3 << 4) /* Priority for the DMA AHB interface of arbiter 5. 00: low priority (default) 01:  */
#define MEMCTRL_ARB5_AHB_DMA_PRIO_POS           (4) /* Priority for the DMA AHB interface of arbiter 5. 00: low priority (default) 01:  */
#define MEMCTRL_ARB5_AHB_CPUS_PRIO_MASK         (0x3 << 2) /* Priority for the CPUS AHB interface of arbiter 5. 00: low priority (default) 01: */
#define MEMCTRL_ARB5_AHB_CPUS_PRIO_POS          (2) /* Priority for the CPUS AHB interface of arbiter 5. 00: low priority (default) 01: */

/* MEM_STALL Register */

#define MEMCTRL_SNC_MAX_STALL_MASK              (0xF << 12) /* Maximum allowed number of stall cycles for the SNC interface. If exceeded, the i */
#define MEMCTRL_SNC_MAX_STALL_POS               (12) /* Maximum allowed number of stall cycles for the SNC interface. If exceeded, the i */
#define MEMCTRL_AHB_DMA_MAX_STALL_MASK          (0xF << 8) /* Maximum allowed number of stall cycles for the DMA AHB interface. If exceeded, t */
#define MEMCTRL_AHB_DMA_MAX_STALL_POS           (8) /* Maximum allowed number of stall cycles for the DMA AHB interface. If exceeded, t */
#define MEMCTRL_AHB_CPUS_MAX_STALL_MASK         (0xF << 4) /* Maximum allowed number of stall cycles for the CPUS AHB interface. If exceeded,  */
#define MEMCTRL_AHB_CPUS_MAX_STALL_POS          (4) /* Maximum allowed number of stall cycles for the CPUS AHB interface. If exceeded,  */
#define MEMCTRL_AHB_CPUC_MAX_STALL_MASK         (0xF << 0) /* Maximum allowed number of stall cycles for the CPUC AHB interface. If exceeded,  */
#define MEMCTRL_AHB_CPUC_MAX_STALL_POS          (0) /* Maximum allowed number of stall cycles for the CPUC AHB interface. If exceeded,  */

/* MEM_STATUS2 Register */

#define MEMCTRL_RAM13_OFF_BUT_ACCESS            (1U << 13) /* Reading a 1 indicates RAM13 was off but still access was performed. Writing a 1  */
#define MEMCTRL_RAM12_OFF_BUT_ACCESS            (1U << 12) /* Reading a 1 indicates RAM12 was off but still access was performed. Writing a 1  */
#define MEMCTRL_RAM11_OFF_BUT_ACCESS            (1U << 11) /* Reading a 1 indicates RAM11 was off but still access was performed. Writing a 1  */
#define MEMCTRL_RAM10_OFF_BUT_ACCESS            (1U << 10) /* Reading a 1 indicates RAM10 was off but still access was performed. Writing a 1  */
#define MEMCTRL_RAM9_OFF_BUT_ACCESS             (1U << 9) /* Reading a 1 indicates RAM9 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM8_OFF_BUT_ACCESS             (1U << 8) /* Reading a 1 indicates RAM8 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM7_OFF_BUT_ACCESS             (1U << 7) /* Reading a 1 indicates RAM7 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM6_OFF_BUT_ACCESS             (1U << 6) /* Reading a 1 indicates RAM6 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM5_OFF_BUT_ACCESS             (1U << 5) /* Reading a 1 indicates RAM5 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM4_OFF_BUT_ACCESS             (1U << 4) /* Reading a 1 indicates RAM4 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM3_OFF_BUT_ACCESS             (1U << 3) /* Reading a 1 indicates RAM3 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM2_OFF_BUT_ACCESS             (1U << 2) /* Reading a 1 indicates RAM2 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM1_OFF_BUT_ACCESS             (1U << 1) /* Reading a 1 indicates RAM1 was off but still access was performed. Writing a 1 w */
#define MEMCTRL_RAM0_OFF_BUT_ACCESS             (1U << 0) /* Reading a 1 indicates RAM0 was off but still access was performed. Writing a 1 w */

